import numpy as np

# ----------------------
# 1. 创建数组
# ----------------------
a = np.array([1, 2, 3])
b = np.array([4, 5, 6])

m1 = np.array([[1,2],[3,4]])
m2 = np.array([[5,6],[7,8]])

# ----------------------
# 2. 基础运算
# ----------------------
print("加法：", a + b)
print("减法：", a - b)
print("乘法：", a * b)
print("除法：", a / b)

# ----------------------
# 3. 矩阵乘法
# ----------------------
print("矩阵乘法：\n", m1 @ m2)

# ----------------------
# 4. 统计运算
# ----------------------
arr = np.array([[1,2,3],
                [4,5,6],
                [7,8,9]])

print("总和：", np.sum(arr))
print("均值：", np.mean(arr))
print("方差：", np.var(arr))
print("标准差：", np.std(arr))

# 按行、按列
print("按列求和：", np.sum(arr, axis=0))
print("按行求和：", np.sum(arr, axis=1))