import pandas as pd
df = pd.read_csv(".vscode\\day13\\data.csv")
df.head()      # 看前5行
df.tail()      # 看后5行
df.shape       # 看多少行多少列
df.info()      # 看数据类型
df.describe()  # 看统计（均值、最大、最小等）


# 练习1：查看前5行数据
# ==========================
print("===== 1. 前5行 =====")
print(df.head())

# ==========================
# 练习2：筛选成绩 >= 90 的学生
# ==========================
print("\n===== 2. 成绩 >= 90 =====")
print(df[df["成绩"] >= 90])

# ==========================
# 练习3：筛选 女生
# ==========================
print("\n===== 3. 所有女生 =====")
print(df[df["性别"] == "女"])

# ==========================
# 练习4：多条件 —— 北京的男生
# ==========================
print("\n===== 4. 北京的男生 =====")
result = df[(df["城市"] == "北京") & (df["性别"] == "男")]
print(result)