import pandas as pd

# ----------------------
# 1. 创建基础 Series
# ----------------------
s1 = pd.Series([1, 2, 3, 4, 5])
print("基础 Series：")
print(s1)

# ----------------------
# 2. 带索引的 Series
# ----------------------
s2 = pd.Series([90, 85, 99], index=["语文", "数学", "英语"])
print("\n带索引 Series：")
print(s2)

# ----------------------
# 3. 查看属性
# ----------------------
print("\n值：", s2.values)
print("索引：", s2.index)
print("数据类型：", s2.dtype)

# ----------------------
# 4. 取值
# ----------------------
print("\n取数学成绩：", s2["数学"])
print("取第0个：", s2[0])

# ----------------------
# 5. 切片
# ----------------------
print("\n前两科：")
print(s2[0:2])

# ----------------------
# 6. 运算
# ----------------------
print("\n加10分：")
print(s2 + 10)

print("\n总分：", s2.sum())
print("平均分：", s2.mean())